namespace dRz.Updater.Services
{
    /// <summary>
    /// Определяет режим проверки и установки необязательных обновлений. Обязательные обновления имеют приоритет.
    /// </summary>
    public enum UpdateMode
    {
        /// <summary>
        /// Не устанавливать необязательные обновления. Manifest всё равно проверяется для обнаружения обязательного обновления.
        /// </summary>
        Disabled,

        /// <summary>
        /// Проверить наличие обновления и запросить согласие перед установкой необязательного обновления.
        /// </summary>
        CheckAndNotify,

        /// <summary>
        /// Проверить наличие обновления и установить необязательное обновление без запроса согласия.
        /// </summary>
        CheckAndInstall
    }
}